# Id Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalGeometryId..::..Id Property
ExternalGeometryId Class See Also
---
External geometry identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public string Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As String
	Get
```

Visual C++
---
```text
public:
property String^ Id {
	String^ get ();
}
```

# See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace